<?php

print json_encode(
[
    'data' => [
        [
            'id' => 1,
            'name' => 'Категория 1',
            'children' => [
                [
                    'id' => 2,
                    'name' => 'Категория 1.1',
                ],
                [
                    'id' => 3,
                    'name' => 'Категория 1.2',
                ]
        ]
        ],
        [
            'id' => 4,
            'name' => 'Категория 2',
            'children' => [
                [
                    'id' => 5,
                    'name' => 'Категория 2.1',
                ],
                [
                    'id' => 6,
                    'name' => 'Категория 2.2',
                    'children' => [
                        [
                            'id' => 7,
                            'name' => 'Категория 2.2.1',
                        ]
                    ]
                ]
        ]
        ]
    ],
    'default' => [1, 5, 7]
]);
?>